In [200]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]= (20,10)

In [201]:
df1=pd.read_csv("Bengaluru_House_Data.csv")
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [202]:
df1.shape

(13320, 9)

In [14]:
df1.groupby('Type')['Type'].agg('count')

Type
Apartment        593
Builder_Floor    661
Name: Type, dtype: int64

In [203]:
df2=df1.drop(['area_type','society','balcony','availability'],axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [204]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [205]:
df3=df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [206]:
df3.shape
df3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [207]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [208]:
df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))
df3.bhk.unique()

C:\Users\ssoni\AppData\Local\Temp/ipykernel_836/2716584372.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [209]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [210]:
df3[~df3['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  bhk
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [211]:
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [212]:
df4 = df3.copy()
df4.total_sqft = df4.total_sqft.apply(convert_sqft_to_num)
df4 = df4[df4.total_sqft.notnull()]
df4.head(2)

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4

In [24]:
df5.head()

,Area,BHK,Bathroom,Furnishing,Locality,Parking,Price,Transaction,Type,Per_Sqft
1,750.0,2,2.0,Semi-Furnished,"J R Designers Floors, Rohini Sector 24",1.0,5000000,New_Property,Apartment,6667.0
2,950.0,2,2.0,Furnished,"Citizen Apartment, Rohini Sector 13",1.0,15500000,Resale,Apartment,6667.0
3,600.0,2,2.0,Semi-Furnished,Rohini Sector 24,1.0,4200000,Resale,Builder_Floor,6667.0
4,650.0,2,2.0,Semi-Furnished,Rohini Sector 24 carpet area 650 sqft status R...,1.0,6200000,New_Property,Builder_Floor,6667.0
5,1300.0,4,3.0,Semi-Furnished,Rohini Sector 24,1.0,15500000,New_Property,Builder_Floor,6667.0

In [213]:
df4.loc[30]

location      Yelahanka
size              4 BHK
total_sqft       2475.0
bath                4.0
price             186.0
bhk                   4
Name: 30, dtype: object

In [214]:
df5 = df4.copy()
df5['price_per_sqft'] = df5['price']*100000/df5['total_sqft']
df5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [215]:
df5_stats = df5['price_per_sqft'].describe()
df5_stats

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [216]:
df5.to_csv("bhp.csv",index=False)

In [217]:
df5.location = df5.location.apply(lambda x: x.strip())
location_stats = df5['location'].value_counts(ascending=False)
location_stats

Whitefield                   533
Sarjapur  Road               392
Electronic City              304
Kanakpura Road               264
Thanisandra                  235
                            ...
Rajanna Layout                 1
Subramanyanagar                1
Lakshmipura Vidyaanyapura      1
Malur Hosur Road               1
Abshot Layout                  1
Name: location, Length: 1287, dtype: int64

In [218]:
location_stats.values.sum()

13200

In [219]:
len(location_stats[location_stats>10])

240

In [220]:
len(location_stats)

1287

In [221]:
len(location_stats[location_stats<=10])

1047

In [222]:
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

BTM 1st Stage                10
Gunjur Palya                 10
Nagappa Reddy Layout         10
Sector 1 HSR Layout          10
Thyagaraja Nagar             10
                             ..
Rajanna Layout                1
Subramanyanagar               1
Lakshmipura Vidyaanyapura     1
Malur Hosur Road              1
Abshot Layout                 1
Name: location, Length: 1047, dtype: int64

In [223]:

len(df5.location.unique())

1287

In [224]:
df5.location = df5.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)
len(df5.location.unique())

241

In [225]:
df5.head(10)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804

In [226]:
df5[df5.total_sqft/df5.bhk<300].head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
9,other,6 Bedroom,1020.0,6.0,370.0,6,36274.509804
45,HSR Layout,8 Bedroom,600.0,9.0,200.0,8,33333.333333
58,Murugeshpalya,6 Bedroom,1407.0,4.0,150.0,6,10660.980810
68,Devarachikkanahalli,8 Bedroom,1350.0,7.0,85.0,8,6296.296296
70,other,3 Bedroom,500.0,3.0,100.0,3,20000.000000

In [227]:
df5.shape

(13200, 7)

In [228]:
df5.shape

(13200, 7)

In [230]:
df6 = df5[~(df5.total_sqft/df5.bhk<300)]
df6.shape

(12456, 7)

In [231]:
df6.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [241]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
df7 = remove_pps_outliers(df6)
df7.shape

(10242, 7)

In [233]:
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')
df8 = remove_bhk_outliers(df7)
# df8 = df7.copy()
df8.shape

(7317, 7)

In [243]:
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)
plt.hist(df8.price_per_sqft,rwidth=0.8)
plt.xlabel("Price Per Square Feet")
plt.ylabel("Count")

AttributeError: 'DataFrame' object has no attribute 'Locality'

In [235]:
df8[df8.bath>10]

            location    size  total_sqft  bath  price  bhk  price_per_sqft
5277  Neeladri Nagar  10 BHK      4000.0  12.0  160.0   10     4000.000000
8483           other  10 BHK     12000.0  12.0  525.0   10     4375.000000
8572           other  16 BHK     10000.0  16.0  550.0   16     5500.000000
9306           other  11 BHK      6000.0  12.0  150.0   11     2500.000000
9637           other  13 BHK      5425.0  13.0  275.0   13     5069.124424

In [236]:
df9 = df8[df8.bath<df8.bhk+2]
df9.shape

(7239, 7)

In [237]:
df10 = df9.drop(['size','price_per_sqft'],axis='columns')
df10.head(3)

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3

In [238]:
dummies = pd.get_dummies(df10.location)
dummies.head(3)

,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur,other
0,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [239]:
df11 = pd.concat([df10,dummies.drop('other',axis='columns')],axis='columns')
df11.head()

,location,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,1st Block Jayanagar,2850.0,4.0,428.0,4,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1st Block Jayanagar,1630.0,3.0,194.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1st Block Jayanagar,1875.0,2.0,235.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1st Block Jayanagar,1200.0,2.0,130.0,3,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1st Block Jayanagar,1235.0,2.0,148.0,2,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [244]:
df12 = df11.drop('location',axis='columns')
df12.head(2)

,total_sqft,bath,price,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,2850.0,4.0,428.0,4,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,194.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [245]:

df12.shape

(7239, 244)

In [246]:
X = df12.drop(['price'],axis='columns')
X.head(3)

,total_sqft,bath,bhk,1st Block Jayanagar,1st Phase JP Nagar,2nd Phase Judicial Layout,2nd Stage Nagarbhavi,5th Block Hbr Layout,5th Phase JP Nagar,6th Phase JP Nagar,...,Vijayanagar,Vishveshwarya Layout,Vishwapriya Layout,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yelenahalli,Yeshwanthpur
0,2850.0,4.0,4,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1630.0,3.0,3,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1875.0,2.0,3,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [247]:
X.shape

(7239, 243)

In [248]:
y = df12.price
y.head(3)

0    428.0
1    194.0
2    235.0
Name: price, dtype: float64

In [249]:

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=10)

In [250]:
from sklearn.linear_model import LinearRegression
lr_clf = LinearRegression()
lr_clf.fit(X_train,y_train)
lr_clf.score(X_test,y_test)

0.8629132245229443

In [251]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)

cross_val_score(LinearRegression(), X, y, cv=cv)

array([0.82702546, 0.86027005, 0.85322178, 0.8436466 , 0.85481502])

In [252]:
from sklearn import metrics

In [254]:
from sklearn.ensemble import RandomForestRegressor
ran=RandomForestRegressor()
ran.fit(X_train, y_train)
y_pred= ran.predict(X_test)
ran_r2=metrics.r2_score(y_test, y_pred)
ran_MSE=metrics.mean_squared_error(y_test, y_pred)
ran_RMSE=np.sqrt(metrics.mean_squared_error(y_test, y_pred))
print("R^2 Score:", ran_r2)
print("MSE Score:", ran_MSE)
print("RMSE Score:", ran_RMSE)

R^2 Score: 0.7746029889892376
MSE Score: 1169.1133843755554
RMSE Score: 34.19230007436697

In [255]:
lr_clf.coef_

array([ 8.01179032e-02,  3.71694671e+00, -1.50202644e+00,  1.20968537e+02,
        2.45037670e+00, -5.29380959e+01,  1.02788383e+02, -7.03146246e+01,
       -3.89299631e+01, -1.85179731e+01, -1.81540697e+01, -4.72181903e+01,
       -4.55005897e+01, -3.59209534e+01, -5.25789908e+01, -4.21299763e+01,
       -2.79617748e+01, -2.96745769e+01, -3.37243927e+01, -4.30523354e+01,
       -4.63572753e+01, -3.53450116e+01, -5.04870285e+01, -4.31831077e+01,
       -3.37223267e+01, -3.49151967e+01, -1.91070208e+01,  4.95276158e+00,
       -4.11542129e+01, -5.20629169e+01, -2.93242196e+01, -1.62662047e+01,
       -3.25217236e+01,  8.45740507e+01, -3.40426878e+01, -6.15425453e+01,
       -6.13320691e+01, -3.06144991e+01, -3.36020349e+01, -1.34178998e+01,
       -3.20742334e+01,  2.94946931e+01, -3.20698342e-01, -4.93174749e+01,
       -4.54625244e+01, -5.58189272e+01, -3.31242244e+01,  1.19335410e+02,
       -4.54819617e+01, -3.09336005e+01, -2.33894756e+01,  1.00442670e-02,
       -3.86470982e+01, -4.55335854e+01, -4.69654900e+01, -5.92550733e+01,
        4.16783456e+00, -2.01314575e+01, -3.95753039e+01, -3.16579360e+01,
        1.94133601e+01, -4.46304187e+01, -5.07547769e+01, -1.00666974e+02,
       -8.21626819e+01, -3.70589122e+01, -3.83473956e+01,  7.36530127e+01,
        1.73991904e+00,  4.47440957e+02, -2.63046661e+01, -4.00456735e+01,
       -3.98556680e+01, -4.39754317e+01, -4.10811933e+01, -1.98223564e+01,
       -4.25522749e+01, -4.49945156e+01,  1.13061166e+01, -6.04321208e+01,
       -2.52098487e+01, -3.27200188e+01, -5.04560467e+01, -3.46298661e+01,
        4.14911485e+01, -5.03505288e+01, -4.13288114e+01,  1.82466989e+02,
       -4.72985842e+01, -5.08081202e+01, -2.69778133e+01, -4.24743531e+01,
       -4.98208074e+01,  2.12124565e+02, -2.01484665e+01, -1.56873567e+01,
       -4.37881013e+01, -4.37463971e+01, -2.10877803e+01, -1.10673969e+01,
        2.08800227e+01, -2.77036479e+01, -4.64626036e+01, -2.81671140e+01,
       -3.38687410e+01, -4.54143664e+01, -4.85714141e+01, -4.02241751e+01,
       -3.29108865e+01,  3.00173682e+01, -5.27807211e+01, -3.01971759e+01,
       -2.99093209e+01, -4.80652829e+01, -4.56522838e+01, -2.35517698e+01,
        1.11896651e+02, -2.78627212e+01, -2.55017339e+01, -1.70890644e+01,
       -3.04840180e+01, -2.92307205e+01,  1.97964985e+01, -4.63862459e+01,
       -4.20186250e+01, -4.05939894e+01, -4.58807823e+01, -2.50803926e+01,
       -3.50914681e+01, -4.15790158e+01, -3.29829554e+01, -3.12782676e+01,
       -2.53430688e+01, -4.75340592e+01, -3.80801692e+01, -3.07211985e+01,
       -3.53763742e+01, -1.22463343e+01, -2.97711770e+01, -2.77653700e+01,
       -3.08221481e+01, -3.61073264e+01, -2.87473900e+01, -3.38184071e+01,
       -3.77193513e+01, -4.64788305e+01, -4.23407549e+01, -3.32956579e+01,
       -3.03033606e+00,  5.45751659e+01, -3.73781019e+01,  2.73869042e+00,
        5.41618111e+01, -5.19119682e+01, -4.33189969e+01, -4.24165090e+01,
       -3.50757390e+01, -4.79854283e+01, -1.17526862e+01, -3.34704161e+01,
       -2.59593987e+01, -1.90333321e+01, -2.95094680e+01, -4.43623705e+01,
       -4.29802209e+01,  2.36169707e+01, -4.20001452e+01, -4.32104138e+01,
        1.19097141e+02, -3.30946210e+01, -2.90885220e+01,  1.91761915e+00,
       -7.31571043e+01, -4.56828072e+01, -4.81775237e+01, -3.28085602e+01,
       -3.76077309e+01, -6.02778215e+01, -1.28895282e+01, -3.90010899e+01,
       -3.94220924e+01, -7.15630774e+00, -3.83541576e+01, -5.04325429e+01,
       -5.33499522e+01, -2.13479396e+01, -1.94379265e+01, -3.09913413e+01,
       -9.63353632e+00, -5.13735194e+01, -2.24751685e+01, -4.98826792e+01,
       -4.00980355e+01, -3.55553331e+01, -2.53380594e+01, -1.43065784e+01,
       -3.40221252e+01, -5.05177300e+01,  1.44365570e+02, -3.51389474e+01,
       -3.07748477e+01, -3.84123015e+01, -5.62790864e+01, -2.64235563e+01,
       -5.55557724e+00,  7.18866532e+01, -4.83033387e+01, -2.56050982e+01,
       -6.28636417e+01, -2.68619766e+01,  8.24813415e+00, -4.00302357e+01,
       -4.81558302e+01, -5.75514896e-01, -4.28331526e+01, -3.88923639e+01,
       -5.33725612e+01, -4.17693616e+01, -3.14245858e+01, -3.54902082e+01,
       -2.64956404e+01, -3.32053290e+01, -2.85783826e+01, -1.40484274e+01,
       -2.34751639e+01, -6.77647838e+01, -2.12743889e+01,  6.81685726e+00,
       -4.80060709e+01, -4.19980066e+01, -4.50019789e+01, -4.71001063e+01,
       -3.66675665e+01, -1.97061542e+01, -6.96962057e+01, -3.59473456e+01,
       -3.68143320e+01, -2.76889538e+01, -3.12697084e+01, -3.51551155e+01,
       -2.88182259e+01, -5.38375904e+01, -1.32355523e+01])

In [256]:
lr_clf.intercept_

-3.1324178525028685

In [257]:
def predict_price(location,sqft,bath,bhk):    
    loc_index = np.where(X.columns==location)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bath
    x[2] = bhk
    if loc_index >= 0:
        x[loc_index] = 1

    return lr_clf.predict([x])[0]

In [258]:
predict_price('Indira Nagar',1000, 3, 3)

195.52689759854636

In [259]:
import pickle
with open('banglore_home_prices_model.pickle','wb') as f:
    pickle.dump(lr_clf,f)

In [260]:
import json
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))